tap "aybabtme/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "wagoodman/dive"
tap "hashicorp/tap"
tap "bufbuild/buf"
tap "nats-io/nats-tools"

# Configure where our applications go
cask_args appdir: '/Applications'
# get brew cask for apps
# Additional Apps
cask "1password-cli"
cask "1password"
cask "alt-tab"
cask "amethyst"
cask "cleanshot"
cask "docker"
cask "drawio"
cask "iterm2"
cask "logseq"
cask "soundsource"
cask "spotify"
cask "typora"
cask "vagrant"
cask "visual-studio-code"
# Browsers
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'
# Messengers
cask 'signal'
cask 'slack'
cask 'discord'
# Cloud Provider
brew "awscli"
brew "azure-cli"
brew "doctl"
cask "google-cloud-sdk"
brew "angle-grinder"
brew "bufbuild/buf/buf"
brew "bash"
brew "cfssl"
brew "colordiff"
brew "coreutils"
brew "nats-io/nats-tools/nats"
brew "curl"
brew "direnv"
brew "dlv"
# brew "go" # installed via asdf
brew "detox"
# brew "etcd"
brew "exiftool"
brew "ffmpeg"
brew fish
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "git-crypt"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "dive"
brew "htop"
brew "hub"
brew "hugo"
brew "jq"
brew "jump"
brew "pkg-config"
brew "protobuf"
brew "rclone"
brew "reattach-to-user-namespace"
# brew "rust" # todo: install via asdf
brew "shellcheck"
# brew "terraform" # installed via asdf
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "watch"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# fun
cask "cool-retro-term"
cask "daisydisk"

# Job
brew "checkov"
brew "diff-so-fancy"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "gzip"
brew "pre-commit"
brew "tflint"
brew "util-linux"
cask "tableplus"
cask "forticlient-vpn"
tap "warrensbox/tap"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "kustomize"
brew "k9s"
brew "kind"
brew "velero"

# Experimentation
brew "zoxide"
brew "bat"
brew "entr"
