tap "aybabtme/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wagoodman/dive"
tap "hashicorp/tap"

# Configure where our applications go
cask_args appdir: '/Applications'

# get brew cask for apps
tap 'homebrew/cask'

# Additional Apps
# cask 'alacritty'
cask "1password-cli"
cask "1password"
cask "alt-tab"
cask "amethyst"
cask "cleanshot"
cask "docker"
cask "drawio"
cask "iterm2"
cask "logseq"
cask "mutify"
cask "soundsource"
cask "spotify"
cask "typora"
cask "vagrant"
cask "visual-studio-code"

# Browsers
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'

# Messengers
cask 'signal'
cask 'slack'
cask 'discord'

brew "angle-grinder"
brew "awscli"
brew "bash"
brew "cfssl"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "direnv"
# brew "go" # installed via asdf
brew "detox"
brew "direnv"
brew "doctl"
# brew "etcd"
brew "exiftool"
brew "ffmpeg"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "git-crypt"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "kubernetes-cli"
brew "kustomize"
brew "k9s"
brew "dive"
brew "htop"
brew "hub"
brew "hugo"
brew "jq"
brew "jump"
brew "kind"
brew "octant"
brew "pkg-config"
brew "protobuf"
brew "rclone"
brew "reattach-to-user-namespace"
# brew "rust" # todo: install via asdf
brew "shellcheck"
# brew "terraform" # installed via asdf
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "watch"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# fun
cask "cool-retro-term"
cask "daisydisk"
