# Taps
tap "aybabtme/tap" # Not needed anymore?
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
tap "bufbuild/buf"
tap "nats-io/nats-tools"

##### Casks (GUI Apps)
# Configure where our applications go
cask_args appdir: '/Applications'
# Additional Apps
cask "1password-cli"
cask "1password"
# cask "alt-tab"
# cask "amethyst"
cask "cleanshot"
cask "daisydisk"
cask "iterm2" # remove?
cask "logseq"
cask "soundsource"
cask "spotify"
cask "typora"
cask "vagrant" # remove?
cask "visual-studio-code"
brew "stats"
#cask "cool-retro-term"

# Browsers
cask 'arc'
cask 'firefox'
cask 'google-chrome'
# Messengers
cask 'signal'
cask 'slack'
cask 'discord'

##### Brews (CLI Apps)
# Cloud Provider
brew "awscli"
brew "azure-cli"
brew "doctl"
cask "google-cloud-sdk"
brew "tflint"
brew "terraform"

# Programming Languages
brew "go" # installed via asdf
brew "dlv"
brew "bufbuild/buf/buf"
brew "protobuf"
brew "shellcheck"
brew "checkov"
brew "direnv"
brew "entr"
brew "zig"

# Media Editing
brew "exiftool"
brew "ffmpeg"

# Shell
cask "nikitabobko/tap/aerospace"
brew "zellij"
brew "fish"
brew "starship"
brew "fzf"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bash"
brew "atuin"

# Git
brew "gh"
brew "git"
brew "git-crypt"
brew "pre-commit"
brew "diff-so-fancy" # still needed?
brew "diffutils"     # still needed?

# Tools
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "gzip"
brew "util-linux"
brew "gettext"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "jq"
brew "pkg-config"
brew "tree"
brew "vim"
brew "wget"
brew "watch"
brew "hugo"
brew "cfssl"
brew "coreutils"
brew "curl"
brew "nats-io/nats-tools/nats"
brew "findutils"
brew "gawk"
#brew "rclone"

# Job
cask "tableplus"
cask "forticlient-vpn"
tap "warrensbox/tap"

# Containers
cask "orbstack"
tap "wagoodman/dive"
brew "dive"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "Azure/kubelogin/kubelogin"
brew "helm"
brew "kustomize"
brew "k9s"
brew "kind"
brew "velero"
brew "wasmtime"

# Experimentation
brew "bat"

# Keep
#
# Slice and dice logs on the command line
# https://github.com/rcoh/angle-grinder
# brew "angle-grinder"
#
# colordiff — a tool to colorize diff output
# https://github.com/daveewart/colordiff
# brew "colordiff"
