# Job
# brew 'helm'
brew 'awscli'
brew 'bash'
brew 'checkov'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'git-chglog'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'go'
brew 'grep'
brew 'gzip'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'pre-commit'
brew 'shellcheck'
brew 'skopeo'
brew 'terraform-docs'
cask 'tableplus'
brew 'tflint'
brew 'tfswitch'
cask 'tunnelblick'
brew 'util-linux'
brew 'yq@3'
brew 'velero'
tap 'git-chglog/git-chglog'
tap 'warrensbox/tap'
