# Job
brew "awscli"
brew "bash"
brew "checkov"
brew "coreutils"
brew "diff-so-fancy"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "git-chglog"
brew "git"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "gzip"
brew "helm"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "pre-commit"
brew "shellcheck"
brew "tflint"
brew "util-linux"
brew "velero"
cask "tableplus"
cask "forticlient-vpn"
tap "git-chglog/git-chglog"
tap "warrensbox/tap"
